---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DivisionSketchCurveDivisionParamsOverrideParam
source: html/4be0af45-1f93-432b-a020-d1f98f3fb81a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DivisionSketchCurveDivisionParamsOverrideParam Property

"Profile Override"

## Syntax (C#)
```csharp
public static ForgeTypeId DivisionSketchCurveDivisionParamsOverrideParam { get; }
```